### sql_연습문제

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('./test.db')

In [3]:
cur = conn.cursor()

In [4]:
cur.execute("CREATE TABLE team(\
            Id integer Primary key,\
            Group_name text,\
            Number int,\
            Date datetime,\
            Company text)")

In [53]:
import pandas as pd
team = pd.read_csv('data/singers.csv', encoding = 'CP949')
team.head()

    name  member_no       debut company
0  방탄소년단          7  2013-06-13  빅히트 엔터
1    마마무          4  2014-06-19     RBW
2   우주소녀         13  2016-02-25  스타쉽 엔터
3    블락비          7  2011-04-15   KQ 엔터
4     엑소          9  2012-04-08   SM 엔터

In [9]:
sql = "INSERT INTO team(Group_name, Number, Date, Company)\
        VALUES(?, ?, ?, ?)"
for num in range(len(team)):
    cur.execute(sql, (team['name'][num], int(team['member_no'][num]),
                      team['debut'][num], team['company'][num]))

In [10]:
cur.execute("select * from team")
cur.fetchall()

[(1, '방탄소년단', 7, '2013-06-13', '빅히트 엔터'),
 (2, '마마무', 4, '2014-06-19', 'RBW'),
 (3, '우주소녀', 13, '2016-02-25', '스타쉽 엔터'),
 (4, '블락비', 7, '2011-04-15', 'KQ 엔터'),
 (5, '엑소', 9, '2012-04-08', 'SM 엔터'),
 (6, '트와이스', 9, '2015-10-20', 'JYP 엔터')]

In [11]:
conn.commit()

In [66]:
conn.close()

In [120]:
cur.execute("drop table song")

In [121]:
cur.execute("CREATE TABLE song(\
            song_Id integer Primary key,\
            song_name text,\
            group_Id int,\
            year datetime,\
            composer text,\
            lyrics text)")

In [122]:
song = pd.read_csv('data/songs.csv', encoding = "CP949")
song.head()

                  song  gid  year composer                             lyrics
0          작은 것들을 위한 시    1  2019  Pdogg 외            모든 게 궁금해 How’s your day
1            FAKE LOVE    1  2018  Pdogg 외        널 위해서라면 난 슬퍼도 기쁜 척 할 수가 있었어
2              넌 is 뭔들    2  2016    김도훈 외              Hey 거기 미소가 예쁜 남자 바로 너
3  음오아예 (Um Oh Ah Yeh)    2  2015      김도훈  oh yes 음 오 아 예 너에게 빠져들겠어 자꾸 반응하잖아
4                  HER    4  2014     지코 외      Jesus 무슨 말이 필요해 모두 널 작품이라고 불러

In [123]:
sql2 = "INSERT INTO song(song_name, group_Id, year, composer, lyrics)\
        VALUES(?, ?, ?, ?, ?)"
for num in range(len(song)):
    cur.execute(sql2, (song['song'][num], int(song['gid'][num]),
                       int(song['year'][num]),
                       song['composer'][num], song['lyrics'][num]))

In [124]:
cur.execute("select * from song")
cur.fetchall()

[(1, '작은 것들을 위한 시', 1, 2019, 'Pdogg 외', '모든 게 궁금해 How’s your day'),
 (2, 'FAKE LOVE', 1, 2018, 'Pdogg 외', '널 위해서라면 난 슬퍼도 기쁜 척 할 수가 있었어'),
 (3, '넌 is 뭔들', 2, 2016, '김도훈 외', 'Hey 거기 미소가 예쁜 남자 바로 너'),
 (4,
  '음오아예 (Um Oh Ah Yeh)',
  2,
  2015,
  '김도훈',
  'oh yes 음 오 아 예 너에게 빠져들겠어 자꾸 반응하잖아'),
 (5, 'HER', 4, 2014, '지코 외', 'Jesus 무슨 말이 필요해 모두 널 작품이라고 불러'),
 (6, '으르렁', 5, 2013, '신혁 외', '나 으르렁 으르렁 으르렁 대 나 으르렁 으르렁 으르렁 대'),
 (7, 'MAMA', 5, 2012, '유영진', 'Careless careless Shoot anonymous anonymous'),
 (8, 'CHEER UP', 6, 2016, '블랙아이드필승 외', 'CHEER UP BABY CHEER UP BABY 좀 더 힘을 내'),
 (9, 'TT', 6, 2016, '블랙아이드필승 외', '이런 내 맘 모르고 너무해 너무해'),
 (10,
  '빨간 맛',
  11,
  2017,
  'Ludwig Lindell 외',
  '빨간 맛 궁금해 Honey 깨물면 점점 녹아든 스트로베리 그 맛')]

In [125]:
conn.commit()

In [139]:
sql = '''select Group_name, Number, Date, song_name, year
         from team as t
         inner join song as s
         on t.id = s.group_id'''

In [140]:
cur.execute(sql)
new_table = cur.fetchall()

In [141]:
table = pd.DataFrame(new_table, columns = ['그룹이름','구성원수','데뷔일자',
                                           '노래이름','발표년도'])
table

    그룹이름  구성원수        데뷔일자                 노래이름  발표년도
0  방탄소년단     7  2013-06-13          작은 것들을 위한 시  2019
1  방탄소년단     7  2013-06-13            FAKE LOVE  2018
2    마마무     4  2014-06-19              넌 is 뭔들  2016
3    마마무     4  2014-06-19  음오아예 (Um Oh Ah Yeh)  2015
4    블락비     7  2011-04-15                  HER  2014
5     엑소     9  2012-04-08                  으르렁  2013
6     엑소     9  2012-04-08                 MAMA  2012
7   트와이스     9  2015-10-20             CHEER UP  2016
8   트와이스     9  2015-10-20                   TT  2016

In [142]:
conn.close()